Revit 2024 API
BindingMap.Item Property
 The get_Item method will get the binding item related to the input key.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public override Binding this[
	Definition key
] { get; set; }
Visual Basic
Public Overrides Property Item ( _
	key As Definition _
) As Binding
	Get
	Set
Visual C++
public:
virtual property Binding^ Item[Definition^ key] {
	Binding^ get (Definition^ key) override;
	void set (Definition^ key, Binding^ value) override;
}
Parameters
key
Type: Autodesk.Revit.DB.Definition
 A parameter definition which can be an existing definition or one from a shared parameters file.
Field Value
 The returned value of get_Item is an InstanceBinding or TypeBinding object that contains the set of categories to which the parameter is bound. The input item is an InstanceBinding or TypeBinding object which contains the set of categories to which the parameter should be bound.
Remarks
 set_Item is not permitted for this class. A Autodesk::Revit::Exceptions::InvalidOperationException will be thrown. Instead use Insert, Remove and ReInsert to modify the bindings in the document.
See Also
BindingMap Class
Autodesk.Revit.DB Namespace